#include<stdio.h>
//计算二进制中1的个数
//int main()
//{
//	int n = 0;
//	scanf_s("%d",&n);
//	//可以通过&与运算符得到二进制中的最低位，n&1得到的就是n的二进制最低位，如果值为1，计数器++就好啦
//	//只求最低为哪行啊，我要的是所有位上1的个数，这时候可以结合移位运算符，n>>1,得到的就是第二位，不信我们看下
//	//比如说我们想求5的二进制位1的个数  0101  2个
//	//00000000000000000000000000000101   --5   &
//	//00000000000000000000000000000001   --1
//	//00000000000000000000000000000001    count=1
//	//00000000000000000000000000000010    5>>1
//	//00000000000000000000000000000001    (5>>1)&1
//	//00000000000000000000000000000000     count=1
//	//00000000000000000000000000000001    5>>2
//	//00000000000000000000000000000001    5>>2&1
//	//00000000000000000000000000000001    count=2
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++) {
//		if (n >> i & 1) count++;
//	}
//	printf("%d", count);
//}

//int main()
//{
//	int n = 0;
//	scanf_s("%d", &n);
//	int count = 0;
//	while (n) {
//		n = n & (n - 1);
//		count++;
//	}
//	printf("%d", count);
//}
//二进制中不同位的个数

//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf_s("%d %d", &a, &b);
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++) {
//		if ((a >> i & 1) != (b >> i & 1)) count++;
//	}
//	printf("%d", count);
//}

//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf_s("%d %d", &a, &b);
//	int c = a ^ b;
//	int count = 0;
//	while (c) {
//		c = c & (c - 1);
//		count++;
//	}
//	printf("%d", count);
//}


//int main()
//{
//    int arr[] = { 1,2,3,4,5 };
//    short* p = (short*)arr;
//    int i = 0;
//    for (i = 0; i < 4; i++)
//    {
//        *(p + i) = 0;
//    }
//
//    for (i = 0; i < 5; i++)
//    {
//        printf("%d ", arr[i]);
//    }
//    return 0;
//}
//int main()
//{
//	unsigned long pulArray[] = { 6,7,8,9,10 };
//	unsigned long* pulPtr;
//	pulPtr = pulArray;
//	*(pulPtr + 3) += 3;
//	printf("%d,%d\n", *pulPtr, *(pulPtr + 3));
//}
//计算求和
//int main()
//{
//	int a = 0;
//	int n = 0;
//	scanf_s("%d %d", &a, &n);
//	int sum = 2;
//	int rst = 2;
//	while (n-1)
//	{
//		rst= rst * 10 + a;
//		sum += rst;
//		n--;
//	}
//	printf("%d", sum);
//}

////进阶水仙花数
//#include<math.h>
//int main()
//{
//	int i = 0;
//	
//	for (i = 1; i < 100000; i++) {
//		//判断位数
//		int tmp = i;
//		int count = 0;
//		int sum = 0;
//		while (tmp) {
//			count++;
//			tmp = tmp / 10;
//		}
//		tmp = i;
//		//判断水仙花数
//		while(tmp){
//			sum += (int)pow(tmp % 10, count);
//			tmp = tmp / 10;
//		}
//		if (sum == i) {
//			printf("%d ", sum);
//		}
//
//	}
//}

////设计一个小程序判断大小端
//int main()
//{
//	int n = 1;
//	char* p = &n;
//	if (*p == 1) {
//		printf("小端\n");
//	}
//	else {
//		printf("大端\n");
//	}
//}

//整型在内存中的存储

//#include <stdio.h>
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//截断
//	//11111111
//	//11111111111111111111111111111111    -1
//	signed char b = -1;
//	unsigned char c = -1;
//	//11111111111111111111111111111111
//	//截断
//	//11111111
//	//00000000000000000000000011111111  255
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}

//#include <stdio.h>
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//截断
//	//10000000
//	// 整型提升
//	//11111111111111111111111110000000
//	printf("%u\n", a);
//	return 0;
//}

//#include <stdio.h>
//int main()
//{
//	char a = 128;
//	//00000000000000000000000010000000
//	//截断
//	//10000000
//	//整型提升
//	//11111111111111111111111110000000
//	printf("%u\n", a);
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100   -20的补码
//	// 
//	//00000000000000000000000000001010
//	// 
//	//11111111111111111111111111110110 
//	//10000000000000000000000000001001
//	//10000000000000000000000000001010
//	unsigned int j = 10;
//	printf("%d", i + j);
//} 
//
////按照补码的形式进行运算，最后格式化成为有符号整数
//int main()
//{
//int i = -20;
//unsigned int j = 10;
//printf("%u\n", i + j);//-10
//return 0;
//}

//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//}

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//		//a[0]=-1 a[1]=-2 a[2]=-3 ……
//	}
//	printf("%d", strlen(a));
//	//strlen()计算的是'\0'之前的元素个数
//	return 0;
//}

//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}